{
  "</think>": 151668,
  "</tool_call>": 151658,
  "</tool_response>": 151666,
  "<im_col>": 151939,
  "<im_end>": 151937,
  "<im_patch>": 151938,
  "<im_slice>": 151941,
  "<im_start>": 151936,
  "<think>": 151667,
  "<tool_call>": 151657,
  "<tool_response>": 151665,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|image|>": 151940,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652,
  "|<EXTRA_TOKENS_0>|": 151669,
  "|<EXTRA_TOKENS_100>|": 151769,
  "|<EXTRA_TOKENS_101>|": 151770,
  "|<EXTRA_TOKENS_102>|": 151771,
  "|<EXTRA_TOKENS_103>|": 151772,
  "|<EXTRA_TOKENS_104>|": 151773,
  "|<EXTRA_TOKENS_105>|": 151774,
  "|<EXTRA_TOKENS_106>|": 151775,
  "|<EXTRA_TOKENS_107>|": 151776,
  "|<EXTRA_TOKENS_108>|": 151777,
  "|<EXTRA_TOKENS_109>|": 151778,
  "|<EXTRA_TOKENS_10>|": 151679,
  "|<EXTRA_TOKENS_110>|": 151779,
  "|<EXTRA_TOKENS_111>|": 151780,
  "|<EXTRA_TOKENS_112>|": 151781,
  "|<EXTRA_TOKENS_113>|": 151782,
  "|<EXTRA_TOKENS_114>|": 151783,
  "|<EXTRA_TOKENS_115>|": 151784,
  "|<EXTRA_TOKENS_116>|": 151785,
  "|<EXTRA_TOKENS_117>|": 151786,
  "|<EXTRA_TOKENS_118>|": 151787,
  "|<EXTRA_TOKENS_119>|": 151788,
  "|<EXTRA_TOKENS_11>|": 151680,
  "|<EXTRA_TOKENS_120>|": 151789,
  "|<EXTRA_TOKENS_121>|": 151790,
  "|<EXTRA_TOKENS_122>|": 151791,
  "|<EXTRA_TOKENS_123>|": 151792,
  "|<EXTRA_TOKENS_124>|": 151793,
  "|<EXTRA_TOKENS_125>|": 151794,
  "|<EXTRA_TOKENS_126>|": 151795,
  "|<EXTRA_TOKENS_127>|": 151796,
  "|<EXTRA_TOKENS_128>|": 151797,
  "|<EXTRA_TOKENS_129>|": 151798,
  "|<EXTRA_TOKENS_12>|": 151681,
  "|<EXTRA_TOKENS_130>|": 151799,
  "|<EXTRA_TOKENS_131>|": 151800,
  "|<EXTRA_TOKENS_132>|": 151801,
  "|<EXTRA_TOKENS_133>|": 151802,
  "|<EXTRA_TOKENS_134>|": 151803,
  "|<EXTRA_TOKENS_135>|": 151804,
  "|<EXTRA_TOKENS_136>|": 151805,
  "|<EXTRA_TOKENS_137>|": 151806,
  "|<EXTRA_TOKENS_138>|": 151807,
  "|<EXTRA_TOKENS_139>|": 151808,
  "|<EXTRA_TOKENS_13>|": 151682,
  "|<EXTRA_TOKENS_140>|": 151809,
  "|<EXTRA_TOKENS_141>|": 151810,
  "|<EXTRA_TOKENS_142>|": 151811,
  "|<EXTRA_TOKENS_143>|": 151812,
  "|<EXTRA_TOKENS_144>|": 151813,
  "|<EXTRA_TOKENS_145>|": 151814,
  "|<EXTRA_TOKENS_146>|": 151815,
  "|<EXTRA_TOKENS_147>|": 151816,
  "|<EXTRA_TOKENS_148>|": 151817,
  "|<EXTRA_TOKENS_149>|": 151818,
  "|<EXTRA_TOKENS_14>|": 151683,
  "|<EXTRA_TOKENS_150>|": 151819,
  "|<EXTRA_TOKENS_151>|": 151820,
  "|<EXTRA_TOKENS_152>|": 151821,
  "|<EXTRA_TOKENS_153>|": 151822,
  "|<EXTRA_TOKENS_154>|": 151823,
  "|<EXTRA_TOKENS_155>|": 151824,
  "|<EXTRA_TOKENS_156>|": 151825,
  "|<EXTRA_TOKENS_157>|": 151826,
  "|<EXTRA_TOKENS_158>|": 151827,
  "|<EXTRA_TOKENS_159>|": 151828,
  "|<EXTRA_TOKENS_15>|": 151684,
  "|<EXTRA_TOKENS_160>|": 151829,
  "|<EXTRA_TOKENS_161>|": 151830,
  "|<EXTRA_TOKENS_162>|": 151831,
  "|<EXTRA_TOKENS_163>|": 151832,
  "|<EXTRA_TOKENS_164>|": 151833,
  "|<EXTRA_TOKENS_165>|": 151834,
  "|<EXTRA_TOKENS_166>|": 151835,
  "|<EXTRA_TOKENS_167>|": 151836,
  "|<EXTRA_TOKENS_168>|": 151837,
  "|<EXTRA_TOKENS_169>|": 151838,
  "|<EXTRA_TOKENS_16>|": 151685,
  "|<EXTRA_TOKENS_170>|": 151839,
  "|<EXTRA_TOKENS_171>|": 151840,
  "|<EXTRA_TOKENS_172>|": 151841,
  "|<EXTRA_TOKENS_173>|": 151842,
  "|<EXTRA_TOKENS_174>|": 151843,
  "|<EXTRA_TOKENS_175>|": 151844,
  "|<EXTRA_TOKENS_176>|": 151845,
  "|<EXTRA_TOKENS_177>|": 151846,
  "|<EXTRA_TOKENS_178>|": 151847,
  "|<EXTRA_TOKENS_179>|": 151848,
  "|<EXTRA_TOKENS_17>|": 151686,
  "|<EXTRA_TOKENS_180>|": 151849,
  "|<EXTRA_TOKENS_181>|": 151850,
  "|<EXTRA_TOKENS_182>|": 151851,
  "|<EXTRA_TOKENS_183>|": 151852,
  "|<EXTRA_TOKENS_184>|": 151853,
  "|<EXTRA_TOKENS_185>|": 151854,
  "|<EXTRA_TOKENS_186>|": 151855,
  "|<EXTRA_TOKENS_187>|": 151856,
  "|<EXTRA_TOKENS_188>|": 151857,
  "|<EXTRA_TOKENS_189>|": 151858,
  "|<EXTRA_TOKENS_18>|": 151687,
  "|<EXTRA_TOKENS_190>|": 151859,
  "|<EXTRA_TOKENS_191>|": 151860,
  "|<EXTRA_TOKENS_192>|": 151861,
  "|<EXTRA_TOKENS_193>|": 151862,
  "|<EXTRA_TOKENS_194>|": 151863,
  "|<EXTRA_TOKENS_195>|": 151864,
  "|<EXTRA_TOKENS_196>|": 151865,
  "|<EXTRA_TOKENS_197>|": 151866,
  "|<EXTRA_TOKENS_198>|": 151867,
  "|<EXTRA_TOKENS_199>|": 151868,
  "|<EXTRA_TOKENS_19>|": 151688,
  "|<EXTRA_TOKENS_1>|": 151670,
  "|<EXTRA_TOKENS_200>|": 151869,
  "|<EXTRA_TOKENS_201>|": 151870,
  "|<EXTRA_TOKENS_202>|": 151871,
  "|<EXTRA_TOKENS_203>|": 151872,
  "|<EXTRA_TOKENS_204>|": 151873,
  "|<EXTRA_TOKENS_205>|": 151874,
  "|<EXTRA_TOKENS_206>|": 151875,
  "|<EXTRA_TOKENS_207>|": 151876,
  "|<EXTRA_TOKENS_208>|": 151877,
  "|<EXTRA_TOKENS_209>|": 151878,
  "|<EXTRA_TOKENS_20>|": 151689,
  "|<EXTRA_TOKENS_210>|": 151879,
  "|<EXTRA_TOKENS_211>|": 151880,
  "|<EXTRA_TOKENS_212>|": 151881,
  "|<EXTRA_TOKENS_213>|": 151882,
  "|<EXTRA_TOKENS_214>|": 151883,
  "|<EXTRA_TOKENS_215>|": 151884,
  "|<EXTRA_TOKENS_216>|": 151885,
  "|<EXTRA_TOKENS_217>|": 151886,
  "|<EXTRA_TOKENS_218>|": 151887,
  "|<EXTRA_TOKENS_219>|": 151888,
  "|<EXTRA_TOKENS_21>|": 151690,
  "|<EXTRA_TOKENS_220>|": 151889,
  "|<EXTRA_TOKENS_221>|": 151890,
  "|<EXTRA_TOKENS_222>|": 151891,
  "|<EXTRA_TOKENS_223>|": 151892,
  "|<EXTRA_TOKENS_224>|": 151893,
  "|<EXTRA_TOKENS_225>|": 151894,
  "|<EXTRA_TOKENS_226>|": 151895,
  "|<EXTRA_TOKENS_227>|": 151896,
  "|<EXTRA_TOKENS_228>|": 151897,
  "|<EXTRA_TOKENS_229>|": 151898,
  "|<EXTRA_TOKENS_22>|": 151691,
  "|<EXTRA_TOKENS_230>|": 151899,
  "|<EXTRA_TOKENS_231>|": 151900,
  "|<EXTRA_TOKENS_232>|": 151901,
  "|<EXTRA_TOKENS_233>|": 151902,
  "|<EXTRA_TOKENS_234>|": 151903,
  "|<EXTRA_TOKENS_235>|": 151904,
  "|<EXTRA_TOKENS_236>|": 151905,
  "|<EXTRA_TOKENS_237>|": 151906,
  "|<EXTRA_TOKENS_238>|": 151907,
  "|<EXTRA_TOKENS_239>|": 151908,
  "|<EXTRA_TOKENS_23>|": 151692,
  "|<EXTRA_TOKENS_240>|": 151909,
  "|<EXTRA_TOKENS_241>|": 151910,
  "|<EXTRA_TOKENS_242>|": 151911,
  "|<EXTRA_TOKENS_243>|": 151912,
  "|<EXTRA_TOKENS_244>|": 151913,
  "|<EXTRA_TOKENS_245>|": 151914,
  "|<EXTRA_TOKENS_246>|": 151915,
  "|<EXTRA_TOKENS_247>|": 151916,
  "|<EXTRA_TOKENS_248>|": 151917,
  "|<EXTRA_TOKENS_249>|": 151918,
  "|<EXTRA_TOKENS_24>|": 151693,
  "|<EXTRA_TOKENS_250>|": 151919,
  "|<EXTRA_TOKENS_251>|": 151920,
  "|<EXTRA_TOKENS_252>|": 151921,
  "|<EXTRA_TOKENS_253>|": 151922,
  "|<EXTRA_TOKENS_254>|": 151923,
  "|<EXTRA_TOKENS_255>|": 151924,
  "|<EXTRA_TOKENS_256>|": 151925,
  "|<EXTRA_TOKENS_257>|": 151926,
  "|<EXTRA_TOKENS_258>|": 151927,
  "|<EXTRA_TOKENS_259>|": 151928,
  "|<EXTRA_TOKENS_25>|": 151694,
  "|<EXTRA_TOKENS_260>|": 151929,
  "|<EXTRA_TOKENS_261>|": 151930,
  "|<EXTRA_TOKENS_262>|": 151931,
  "|<EXTRA_TOKENS_263>|": 151932,
  "|<EXTRA_TOKENS_264>|": 151933,
  "|<EXTRA_TOKENS_265>|": 151934,
  "|<EXTRA_TOKENS_266>|": 151935,
  "|<EXTRA_TOKENS_26>|": 151695,
  "|<EXTRA_TOKENS_27>|": 151696,
  "|<EXTRA_TOKENS_28>|": 151697,
  "|<EXTRA_TOKENS_29>|": 151698,
  "|<EXTRA_TOKENS_2>|": 151671,
  "|<EXTRA_TOKENS_30>|": 151699,
  "|<EXTRA_TOKENS_31>|": 151700,
  "|<EXTRA_TOKENS_32>|": 151701,
  "|<EXTRA_TOKENS_33>|": 151702,
  "|<EXTRA_TOKENS_34>|": 151703,
  "|<EXTRA_TOKENS_35>|": 151704,
  "|<EXTRA_TOKENS_36>|": 151705,
  "|<EXTRA_TOKENS_37>|": 151706,
  "|<EXTRA_TOKENS_38>|": 151707,
  "|<EXTRA_TOKENS_39>|": 151708,
  "|<EXTRA_TOKENS_3>|": 151672,
  "|<EXTRA_TOKENS_40>|": 151709,
  "|<EXTRA_TOKENS_41>|": 151710,
  "|<EXTRA_TOKENS_42>|": 151711,
  "|<EXTRA_TOKENS_43>|": 151712,
  "|<EXTRA_TOKENS_44>|": 151713,
  "|<EXTRA_TOKENS_45>|": 151714,
  "|<EXTRA_TOKENS_46>|": 151715,
  "|<EXTRA_TOKENS_47>|": 151716,
  "|<EXTRA_TOKENS_48>|": 151717,
  "|<EXTRA_TOKENS_49>|": 151718,
  "|<EXTRA_TOKENS_4>|": 151673,
  "|<EXTRA_TOKENS_50>|": 151719,
  "|<EXTRA_TOKENS_51>|": 151720,
  "|<EXTRA_TOKENS_52>|": 151721,
  "|<EXTRA_TOKENS_53>|": 151722,
  "|<EXTRA_TOKENS_54>|": 151723,
  "|<EXTRA_TOKENS_55>|": 151724,
  "|<EXTRA_TOKENS_56>|": 151725,
  "|<EXTRA_TOKENS_57>|": 151726,
  "|<EXTRA_TOKENS_58>|": 151727,
  "|<EXTRA_TOKENS_59>|": 151728,
  "|<EXTRA_TOKENS_5>|": 151674,
  "|<EXTRA_TOKENS_60>|": 151729,
  "|<EXTRA_TOKENS_61>|": 151730,
  "|<EXTRA_TOKENS_62>|": 151731,
  "|<EXTRA_TOKENS_63>|": 151732,
  "|<EXTRA_TOKENS_64>|": 151733,
  "|<EXTRA_TOKENS_65>|": 151734,
  "|<EXTRA_TOKENS_66>|": 151735,
  "|<EXTRA_TOKENS_67>|": 151736,
  "|<EXTRA_TOKENS_68>|": 151737,
  "|<EXTRA_TOKENS_69>|": 151738,
  "|<EXTRA_TOKENS_6>|": 151675,
  "|<EXTRA_TOKENS_70>|": 151739,
  "|<EXTRA_TOKENS_71>|": 151740,
  "|<EXTRA_TOKENS_72>|": 151741,
  "|<EXTRA_TOKENS_73>|": 151742,
  "|<EXTRA_TOKENS_74>|": 151743,
  "|<EXTRA_TOKENS_75>|": 151744,
  "|<EXTRA_TOKENS_76>|": 151745,
  "|<EXTRA_TOKENS_77>|": 151746,
  "|<EXTRA_TOKENS_78>|": 151747,
  "|<EXTRA_TOKENS_79>|": 151748,
  "|<EXTRA_TOKENS_7>|": 151676,
  "|<EXTRA_TOKENS_80>|": 151749,
  "|<EXTRA_TOKENS_81>|": 151750,
  "|<EXTRA_TOKENS_82>|": 151751,
  "|<EXTRA_TOKENS_83>|": 151752,
  "|<EXTRA_TOKENS_84>|": 151753,
  "|<EXTRA_TOKENS_85>|": 151754,
  "|<EXTRA_TOKENS_86>|": 151755,
  "|<EXTRA_TOKENS_87>|": 151756,
  "|<EXTRA_TOKENS_88>|": 151757,
  "|<EXTRA_TOKENS_89>|": 151758,
  "|<EXTRA_TOKENS_8>|": 151677,
  "|<EXTRA_TOKENS_90>|": 151759,
  "|<EXTRA_TOKENS_91>|": 151760,
  "|<EXTRA_TOKENS_92>|": 151761,
  "|<EXTRA_TOKENS_93>|": 151762,
  "|<EXTRA_TOKENS_94>|": 151763,
  "|<EXTRA_TOKENS_95>|": 151764,
  "|<EXTRA_TOKENS_96>|": 151765,
  "|<EXTRA_TOKENS_97>|": 151766,
  "|<EXTRA_TOKENS_98>|": 151767,
  "|<EXTRA_TOKENS_99>|": 151768,
  "|<EXTRA_TOKENS_9>|": 151678
}
