{
  "metadata": {
    "total_parameters": 2481141616,
    "total_size": 9924566464
  },
  "weight_map": {
    "lm_head.weight": "model-00003-of-00003.safetensors",
    "model.language_model.embedding.embedding": "model-00001-of-00003.safetensors",
    "model.language_model.embedding.new_embedding": "model-00001-of-00003.safetensors",
    "model.language_model.layers.0.attn.k_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.0.attn.k_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.0.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.0.attn.q_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.0.attn.q_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.0.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.0.attn.v_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.0.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.0.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.0.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.0.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.1.attn.k_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.1.attn.k_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.1.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.1.attn.q_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.1.attn.q_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.1.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.1.attn.v_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.1.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.1.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.1.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.1.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.10.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.10.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.10.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.10.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.10.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.10.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.10.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.10.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.10.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.10.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.10.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.11.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.11.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.11.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.11.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.11.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.11.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.11.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.11.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.11.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.11.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.11.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.12.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.12.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.12.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.12.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.12.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.12.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.12.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.12.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.12.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.12.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.12.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.13.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.13.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.13.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.13.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.13.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.13.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.13.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.13.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.13.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.13.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.13.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.14.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.14.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.14.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.14.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.14.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.14.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.14.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.14.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.14.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.14.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.14.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.15.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.15.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.15.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.15.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.15.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.15.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.15.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.15.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.15.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.15.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.15.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.16.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.16.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.16.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.16.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.16.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.16.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.16.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.16.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.16.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.16.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.16.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.17.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.17.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.17.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.17.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.17.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.17.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.17.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.17.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.17.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.17.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.17.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.18.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.18.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.18.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.18.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.18.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.18.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.18.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.18.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.18.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.18.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.18.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.19.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.19.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.19.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.19.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.19.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.19.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.19.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.19.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.19.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.19.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.19.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.2.attn.k_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.2.attn.k_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.2.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.2.attn.q_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.2.attn.q_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.2.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.2.attn.v_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.2.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.2.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.2.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.2.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.20.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.20.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.20.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.20.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.20.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.20.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.20.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.20.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.20.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.20.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.20.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.21.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.21.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.21.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.21.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.21.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.21.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.21.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.21.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.21.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.21.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.21.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.22.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.22.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.22.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.22.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.22.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.22.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.22.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.22.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.22.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.22.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.22.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.23.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.23.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.23.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.23.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.23.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.23.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.23.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.23.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.23.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.23.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.23.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.24.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.24.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.24.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.24.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.24.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.24.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.24.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.24.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.24.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.24.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.24.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.25.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.25.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.25.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.25.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.25.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.25.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.25.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.25.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.25.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.25.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.25.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.26.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.26.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.26.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.26.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.26.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.26.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.26.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.26.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.26.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.26.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.26.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.27.attn.k_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.27.attn.k_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.27.attn.out.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.27.attn.q_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.27.attn.q_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.27.attn.qkv_w.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.27.attn.v_b": "model-00002-of-00003.safetensors",
    "model.language_model.layers.27.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.27.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.27.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.27.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.3.attn.k_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.3.attn.k_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.3.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.3.attn.q_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.3.attn.q_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.3.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.3.attn.v_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.3.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.3.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.3.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.3.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.4.attn.k_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.4.attn.k_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.4.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.4.attn.q_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.4.attn.q_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.4.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.4.attn.v_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.4.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.4.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.4.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.4.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.5.attn.k_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.5.attn.k_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.5.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.5.attn.q_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.5.attn.q_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.5.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.5.attn.v_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.5.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.5.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.5.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.5.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.6.attn.k_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.6.attn.k_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.6.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.6.attn.q_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.6.attn.q_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.6.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.6.attn.v_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.6.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.6.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.6.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.6.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.7.attn.k_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.7.attn.k_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.7.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.7.attn.q_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.7.attn.q_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.7.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.7.attn.v_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.7.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.7.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.7.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.7.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.8.attn.k_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.8.attn.k_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.8.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.8.attn.q_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.8.attn.q_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.8.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.8.attn.v_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.8.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.8.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.8.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.8.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.9.attn.k_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.9.attn.k_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.9.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.9.attn.q_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.9.attn.q_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.9.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.language_model.layers.9.attn.v_b": "model-00001-of-00003.safetensors",
    "model.language_model.layers.9.attn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.9.ffn.down.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.9.ffn.up.weight": "model-00002-of-00003.safetensors",
    "model.language_model.layers.9.ffn_lnorm.weight": "model-00002-of-00003.safetensors",
    "model.language_model.ln_f.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.0.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.1.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.10.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.11.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.12.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.13.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.14.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.15.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.16.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.17.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.18.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.19.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.2.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.20.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.21.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.22.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.23.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.attn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.attn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.ffn.down.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.ffn.down.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.ffn.up.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.ffn.up.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.ffn_lnorm.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.24.ffn_lnorm.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.25.attn.k_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.25.attn.out.bias": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.25.attn.out.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.25.attn.q_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.25.attn.qkv_w.weight": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.25.attn.v_b": "model-00001-of-00003.safetensors",
    "model.vision_model.layers.25.attn_lnorm.bias": "model-00001-of-00003.safetensors",
