{
  "additional_special_tokens": [
    "|<EXTRA_TOKENS_0>|",
    "|<EXTRA_TOKENS_1>|",
    "|<EXTRA_TOKENS_2>|",
    "|<EXTRA_TOKENS_3>|",
    "|<EXTRA_TOKENS_4>|",
    "|<EXTRA_TOKENS_5>|",
    "|<EXTRA_TOKENS_6>|",
    "|<EXTRA_TOKENS_7>|",
    "|<EXTRA_TOKENS_8>|",
    "|<EXTRA_TOKENS_9>|",
    "|<EXTRA_TOKENS_10>|",
    "|<EXTRA_TOKENS_11>|",
    "|<EXTRA_TOKENS_12>|",
    "|<EXTRA_TOKENS_13>|",
    "|<EXTRA_TOKENS_14>|",
    "|<EXTRA_TOKENS_15>|",
    "|<EXTRA_TOKENS_16>|",
    "|<EXTRA_TOKENS_17>|",
    "|<EXTRA_TOKENS_18>|",
    "|<EXTRA_TOKENS_19>|",
    "|<EXTRA_TOKENS_20>|",
    "|<EXTRA_TOKENS_21>|",
    "|<EXTRA_TOKENS_22>|",
    "|<EXTRA_TOKENS_23>|",
    "|<EXTRA_TOKENS_24>|",
    "|<EXTRA_TOKENS_25>|",
    "|<EXTRA_TOKENS_26>|",
    "|<EXTRA_TOKENS_27>|",
    "|<EXTRA_TOKENS_28>|",
    "|<EXTRA_TOKENS_29>|",
    "|<EXTRA_TOKENS_30>|",
    "|<EXTRA_TOKENS_31>|",
    "|<EXTRA_TOKENS_32>|",
    "|<EXTRA_TOKENS_33>|",
    "|<EXTRA_TOKENS_34>|",
    "|<EXTRA_TOKENS_35>|",
    "|<EXTRA_TOKENS_36>|",
    "|<EXTRA_TOKENS_37>|",
    "|<EXTRA_TOKENS_38>|",
    "|<EXTRA_TOKENS_39>|",
    "|<EXTRA_TOKENS_40>|",
    "|<EXTRA_TOKENS_41>|",
    "|<EXTRA_TOKENS_42>|",
    "|<EXTRA_TOKENS_43>|",
    "|<EXTRA_TOKENS_44>|",
    "|<EXTRA_TOKENS_45>|",
    "|<EXTRA_TOKENS_46>|",
    "|<EXTRA_TOKENS_47>|",
    "|<EXTRA_TOKENS_48>|",
    "|<EXTRA_TOKENS_49>|",
    "|<EXTRA_TOKENS_50>|",
    "|<EXTRA_TOKENS_51>|",
    "|<EXTRA_TOKENS_52>|",
    "|<EXTRA_TOKENS_53>|",
    "|<EXTRA_TOKENS_54>|",
    "|<EXTRA_TOKENS_55>|",
    "|<EXTRA_TOKENS_56>|",
    "|<EXTRA_TOKENS_57>|",
    "|<EXTRA_TOKENS_58>|",
    "|<EXTRA_TOKENS_59>|",
    "|<EXTRA_TOKENS_60>|",
    "|<EXTRA_TOKENS_61>|",
    "|<EXTRA_TOKENS_62>|",
    "|<EXTRA_TOKENS_63>|",
    "|<EXTRA_TOKENS_64>|",
    "|<EXTRA_TOKENS_65>|",
    "|<EXTRA_TOKENS_66>|",
    "|<EXTRA_TOKENS_67>|",
    "|<EXTRA_TOKENS_68>|",
    "|<EXTRA_TOKENS_69>|",
    "|<EXTRA_TOKENS_70>|",
    "|<EXTRA_TOKENS_71>|",
    "|<EXTRA_TOKENS_72>|",
    "|<EXTRA_TOKENS_73>|",
    "|<EXTRA_TOKENS_74>|",
    "|<EXTRA_TOKENS_75>|",
    "|<EXTRA_TOKENS_76>|",
    "|<EXTRA_TOKENS_77>|",
    "|<EXTRA_TOKENS_78>|",
    "|<EXTRA_TOKENS_79>|",
    "|<EXTRA_TOKENS_80>|",
    "|<EXTRA_TOKENS_81>|",
    "|<EXTRA_TOKENS_82>|",
    "|<EXTRA_TOKENS_83>|",
    "|<EXTRA_TOKENS_84>|",
    "|<EXTRA_TOKENS_85>|",
    "|<EXTRA_TOKENS_86>|",
    "|<EXTRA_TOKENS_87>|",
    "|<EXTRA_TOKENS_88>|",
    "|<EXTRA_TOKENS_89>|",
    "|<EXTRA_TOKENS_90>|",
    "|<EXTRA_TOKENS_91>|",
    "|<EXTRA_TOKENS_92>|",
    "|<EXTRA_TOKENS_93>|",
    "|<EXTRA_TOKENS_94>|",
    "|<EXTRA_TOKENS_95>|",
    "|<EXTRA_TOKENS_96>|",
    "|<EXTRA_TOKENS_97>|",
    "|<EXTRA_TOKENS_98>|",
    "|<EXTRA_TOKENS_99>|",
    "|<EXTRA_TOKENS_100>|",
    "|<EXTRA_TOKENS_101>|",
    "|<EXTRA_TOKENS_102>|",
    "|<EXTRA_TOKENS_103>|",
    "|<EXTRA_TOKENS_104>|",
    "|<EXTRA_TOKENS_105>|",
    "|<EXTRA_TOKENS_106>|",
    "|<EXTRA_TOKENS_107>|",
    "|<EXTRA_TOKENS_108>|",
    "|<EXTRA_TOKENS_109>|",
    "|<EXTRA_TOKENS_110>|",
    "|<EXTRA_TOKENS_111>|",
    "|<EXTRA_TOKENS_112>|",
    "|<EXTRA_TOKENS_113>|",
    "|<EXTRA_TOKENS_114>|",
    "|<EXTRA_TOKENS_115>|",
    "|<EXTRA_TOKENS_116>|",
    "|<EXTRA_TOKENS_117>|",
    "|<EXTRA_TOKENS_118>|",
    "|<EXTRA_TOKENS_119>|",
    "|<EXTRA_TOKENS_120>|",
    "|<EXTRA_TOKENS_121>|",
    "|<EXTRA_TOKENS_122>|",
    "|<EXTRA_TOKENS_123>|",
    "|<EXTRA_TOKENS_124>|",
    "|<EXTRA_TOKENS_125>|",
    "|<EXTRA_TOKENS_126>|",
    "|<EXTRA_TOKENS_127>|",
    "|<EXTRA_TOKENS_128>|",
    "|<EXTRA_TOKENS_129>|",
    "|<EXTRA_TOKENS_130>|",
    "|<EXTRA_TOKENS_131>|",
    "|<EXTRA_TOKENS_132>|",
    "|<EXTRA_TOKENS_133>|",
    "|<EXTRA_TOKENS_134>|",
    "|<EXTRA_TOKENS_135>|",
    "|<EXTRA_TOKENS_136>|",
    "|<EXTRA_TOKENS_137>|",
    "|<EXTRA_TOKENS_138>|",
    "|<EXTRA_TOKENS_139>|",
    "|<EXTRA_TOKENS_140>|",
    "|<EXTRA_TOKENS_141>|",
    "|<EXTRA_TOKENS_142>|",
    "|<EXTRA_TOKENS_143>|",
    "|<EXTRA_TOKENS_144>|",
    "|<EXTRA_TOKENS_145>|",
    "|<EXTRA_TOKENS_146>|",
    "|<EXTRA_TOKENS_147>|",
    "|<EXTRA_TOKENS_148>|",
    "|<EXTRA_TOKENS_149>|",
    "|<EXTRA_TOKENS_150>|",
    "|<EXTRA_TOKENS_151>|",
    "|<EXTRA_TOKENS_152>|",
    "|<EXTRA_TOKENS_153>|",
    "|<EXTRA_TOKENS_154>|",
    "|<EXTRA_TOKENS_155>|",
    "|<EXTRA_TOKENS_156>|",
    "|<EXTRA_TOKENS_157>|",
    "|<EXTRA_TOKENS_158>|",
    "|<EXTRA_TOKENS_159>|",
    "|<EXTRA_TOKENS_160>|",
    "|<EXTRA_TOKENS_161>|",
    "|<EXTRA_TOKENS_162>|",
    "|<EXTRA_TOKENS_163>|",
    "|<EXTRA_TOKENS_164>|",
    "|<EXTRA_TOKENS_165>|",
    "|<EXTRA_TOKENS_166>|",
    "|<EXTRA_TOKENS_167>|",
    "|<EXTRA_TOKENS_168>|",
    "|<EXTRA_TOKENS_169>|",
    "|<EXTRA_TOKENS_170>|",
    "|<EXTRA_TOKENS_171>|",
    "|<EXTRA_TOKENS_172>|",
    "|<EXTRA_TOKENS_173>|",
    "|<EXTRA_TOKENS_174>|",
    "|<EXTRA_TOKENS_175>|",
    "|<EXTRA_TOKENS_176>|",
    "|<EXTRA_TOKENS_177>|",
    "|<EXTRA_TOKENS_178>|",
    "|<EXTRA_TOKENS_179>|",
    "|<EXTRA_TOKENS_180>|",
    "|<EXTRA_TOKENS_181>|",
    "|<EXTRA_TOKENS_182>|",
    "|<EXTRA_TOKENS_183>|",
    "|<EXTRA_TOKENS_184>|",
    "|<EXTRA_TOKENS_185>|",
    "|<EXTRA_TOKENS_186>|",
    "|<EXTRA_TOKENS_187>|",
    "|<EXTRA_TOKENS_188>|",
    "|<EXTRA_TOKENS_189>|",
    "|<EXTRA_TOKENS_190>|",
    "|<EXTRA_TOKENS_191>|",
    "|<EXTRA_TOKENS_192>|",
    "|<EXTRA_TOKENS_193>|",
    "|<EXTRA_TOKENS_194>|",
    "|<EXTRA_TOKENS_195>|",
    "|<EXTRA_TOKENS_196>|",
    "|<EXTRA_TOKENS_197>|",
    "|<EXTRA_TOKENS_198>|",
    "|<EXTRA_TOKENS_199>|",
    "|<EXTRA_TOKENS_200>|",
    "|<EXTRA_TOKENS_201>|",
    "|<EXTRA_TOKENS_202>|",
    "|<EXTRA_TOKENS_203>|",
    "|<EXTRA_TOKENS_204>|",
    "|<EXTRA_TOKENS_205>|",
    "|<EXTRA_TOKENS_206>|",
    "|<EXTRA_TOKENS_207>|",
    "|<EXTRA_TOKENS_208>|",
    "|<EXTRA_TOKENS_209>|",
    "|<EXTRA_TOKENS_210>|",
    "|<EXTRA_TOKENS_211>|",
    "|<EXTRA_TOKENS_212>|",
    "|<EXTRA_TOKENS_213>|",
    "|<EXTRA_TOKENS_214>|",
    "|<EXTRA_TOKENS_215>|",
    "|<EXTRA_TOKENS_216>|",
    "|<EXTRA_TOKENS_217>|",
    "|<EXTRA_TOKENS_218>|",
    "|<EXTRA_TOKENS_219>|",
    "|<EXTRA_TOKENS_220>|",
    "|<EXTRA_TOKENS_221>|",
    "|<EXTRA_TOKENS_222>|",
    "|<EXTRA_TOKENS_223>|",
    "|<EXTRA_TOKENS_224>|",
    "|<EXTRA_TOKENS_225>|",
    "|<EXTRA_TOKENS_226>|",
    "|<EXTRA_TOKENS_227>|",
    "|<EXTRA_TOKENS_228>|",
    "|<EXTRA_TOKENS_229>|",
    "|<EXTRA_TOKENS_230>|",
    "|<EXTRA_TOKENS_231>|",
    "|<EXTRA_TOKENS_232>|",
    "|<EXTRA_TOKENS_233>|",
    "|<EXTRA_TOKENS_234>|",
    "|<EXTRA_TOKENS_235>|",
    "|<EXTRA_TOKENS_236>|",
    "|<EXTRA_TOKENS_237>|",
    "|<EXTRA_TOKENS_238>|",
    "|<EXTRA_TOKENS_239>|",
    "|<EXTRA_TOKENS_240>|",
    "|<EXTRA_TOKENS_241>|",
    "|<EXTRA_TOKENS_242>|",
    "|<EXTRA_TOKENS_243>|",
    "|<EXTRA_TOKENS_244>|",
    "|<EXTRA_TOKENS_245>|",
    "|<EXTRA_TOKENS_246>|",
    "|<EXTRA_TOKENS_247>|",
    "|<EXTRA_TOKENS_248>|",
    "|<EXTRA_TOKENS_249>|",
    "|<EXTRA_TOKENS_250>|",
    "|<EXTRA_TOKENS_251>|",
    "|<EXTRA_TOKENS_252>|",
    "|<EXTRA_TOKENS_253>|",
    "|<EXTRA_TOKENS_254>|",
    "|<EXTRA_TOKENS_255>|",
    "|<EXTRA_TOKENS_256>|",
    "|<EXTRA_TOKENS_257>|",
    "|<EXTRA_TOKENS_258>|",
    "|<EXTRA_TOKENS_259>|",
    "|<EXTRA_TOKENS_260>|",
    "|<EXTRA_TOKENS_261>|",
    "|<EXTRA_TOKENS_262>|",
    "|<EXTRA_TOKENS_263>|",
    "|<EXTRA_TOKENS_264>|",
    "|<EXTRA_TOKENS_265>|",
    "|<EXTRA_TOKENS_266>|",
    "<im_start>",
    "<im_end>",
    "<im_patch>",
    "<im_col>",
    "<|image|>",
    "<im_slice>"
  ],
  "eos_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
