---
source_image: page_355.png
page_number: 355
model: model-run-olm-ocr
prompt_type: olmocr_technical
processing_time: 30.29
tokens: 7841
characters: 2931
timestamp: 2025-12-24T01:18:25.647902
finish_reason: stop
---

if x > y: print(x)

В результате у нас появляется возможность записывать односторочные операторы if, односторочные циклы while и for и т.д. Тем не менее, это будет работать, только если тело составного оператора само не содержит каких-либо составных операторов. То есть после двоеточия разрешено указывать лишь простые операторы — присваивания, вызовы print, обращения к функциям и т.п. Более крупные операторы по-прежнему должны находиться в собственных строках. Дополнительные части составных операторов (такие как часть else оператора if, который мы рассмотрим в следующем разделе) также обязаны располагаться в отдельных строках. Тела составных операторов могут состоять из множества простых операторов, разделенных точками с запятой, но обычно такой подход не одобряется.

В общем, хотя временами это необязательно, если вы будете размещать все операторы в отдельных строках и всегда делать отступы для вложенных блоков, то ваш код станет легче читать и изменять в будущем. Более того, некоторые инструменты для профилирования и покрытия кода могут быть не в состоянии проводить различия между множеством операторов, втиснутых в одну строку, или заголовком и телом односторочного составного оператора. Практически всегда в ваших интересах поддерживать в Python простоту. Вы можете применять специальные правила для написания кода Python, который трудно читать, но это требует немало работы, и у вас наверняка найдется, куда лучше потратить свое время.

Однако чтобы увидеть в действии простое и распространенное исключение из указанных правил (использование односторочного оператора if для выхода из цикла с помощью break), а также представить дополнительный синтаксис Python, в следующем разделе будет написан реальный код.

Короткий пример: интерактивные циклы

Мы увидим все описанные правила синтаксиса в действии, когда начнем тур по специфическим составным операторам Python в последующих нескольких главах, но повсюду в языке Python они работают одинаково. Давайте пока рассмотрим короткий, но реалистичный пример, который продемонстрирует практический способ совместного применения синтаксиса операторов и вложения операторов, а также попутно ознакомит с несколькими операторами.

Простой интерактивный пример

Предположим, что вас попросили написать на Python программу, которая взаимодействует с пользователем в окне консоли. Возможно, необходимо принимать ввод для отправки в базу данных или читать числа с целью использования в вычислении. Независимо от предназначения, вам придется написать код цикла, который читает одну или большее количество строк, набираемых пользователем на клавиатуре, и выводит для каждой результат. Другими словами, вы должны написать программу с классическим циклом чтение/оценка/вывод.

Типичный шаблонный код для такого цикла взаимодействия может выглядеть в Python следующим образом:

while True:
    reply = input('Enter text:')
    if reply == 'stop': break
    print(reply.upper())