{
  "architectures": [
    "Qwen2_5_VLForConditionalGeneration"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "hidden_act": "silu",
  "hidden_size": 3584,
  "image_token_id": 151655,
  "initializer_range": 0.02,
  "intermediate_size": 18944,
  "max_position_embeddings": 128000,
  "max_window_layers": 28,
  "model_type": "qwen2_5_vl",
  "num_attention_heads": 28,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "quantization_config": {
    "config_groups": {
      "group_0": {
        "input_activations": {
          "actorder": null,
          "block_structure": null,
          "dynamic": true,
          "group_size": null,
          "num_bits": 8,
          "observer": null,
          "observer_kwargs": {},
          "strategy": "token",
          "symmetric": true,
          "type": "float"
        },
        "output_activations": null,
        "targets": [
          "Linear"
        ],
        "weights": {
          "actorder": null,
          "block_structure": null,
          "dynamic": false,
          "group_size": null,
          "num_bits": 8,
          "observer": "minmax",
          "observer_kwargs": {},
          "strategy": "channel",
          "symmetric": true,
          "type": "float"
        }
      }
    },
    "format": "float-quantized",
    "global_compression_ratio": null,
    "ignore": [
      "model.visual.blocks.0.attn.qkv",
      "model.visual.blocks.0.attn.proj",
      "model.visual.blocks.0.mlp.gate_proj",
      "model.visual.blocks.0.mlp.up_proj",
      "model.visual.blocks.0.mlp.down_proj",
      "model.visual.blocks.1.attn.qkv",
      "model.visual.blocks.1.attn.proj",
      "model.visual.blocks.1.mlp.gate_proj",
      "model.visual.blocks.1.mlp.up_proj",
      "model.visual.blocks.1.mlp.down_proj",
      "model.visual.blocks.2.attn.qkv",
      "model.visual.blocks.2.attn.proj",
      "model.visual.blocks.2.mlp.gate_proj",
      "model.visual.blocks.2.mlp.up_proj",
      "model.visual.blocks.2.mlp.down_proj",
      "model.visual.blocks.3.attn.qkv",
      "model.visual.blocks.3.attn.proj",
      "model.visual.blocks.3.mlp.gate_proj",
      "model.visual.blocks.3.mlp.up_proj",
      "model.visual.blocks.3.mlp.down_proj",
      "model.visual.blocks.4.attn.qkv",
      "model.visual.blocks.4.attn.proj",
      "model.visual.blocks.4.mlp.gate_proj",
      "model.visual.blocks.4.mlp.up_proj",
      "model.visual.blocks.4.mlp.down_proj",
      "model.visual.blocks.5.attn.qkv",
      "model.visual.blocks.5.attn.proj",
      "model.visual.blocks.5.mlp.gate_proj",
      "model.visual.blocks.5.mlp.up_proj",
      "model.visual.blocks.5.mlp.down_proj",
      "model.visual.blocks.6.attn.qkv",
      "model.visual.blocks.6.attn.proj",
      "model.visual.blocks.6.mlp.gate_proj",
      "model.visual.blocks.6.mlp.up_proj",
      "model.visual.blocks.6.mlp.down_proj",
      "model.visual.blocks.7.attn.qkv",
      "model.visual.blocks.7.attn.proj",
      "model.visual.blocks.7.mlp.gate_proj",
      "model.visual.blocks.7.mlp.up_proj",
      "model.visual.blocks.7.mlp.down_proj",
      "model.visual.blocks.8.attn.qkv",
      "model.visual.blocks.8.attn.proj",
      "model.visual.blocks.8.mlp.gate_proj",
      "model.visual.blocks.8.mlp.up_proj",
      "model.visual.blocks.8.mlp.down_proj",
      "model.visual.blocks.9.attn.qkv",
      "model.visual.blocks.9.attn.proj",
      "model.visual.blocks.9.mlp.gate_proj",
      "model.visual.blocks.9.mlp.up_proj",
      "model.visual.blocks.9.mlp.down_proj",
      "model.visual.blocks.10.attn.qkv",
      "model.visual.blocks.10.attn.proj",
      "model.visual.blocks.10.mlp.gate_proj",
      "model.visual.blocks.10.mlp.up_proj",
      "model.visual.blocks.10.mlp.down_proj",
      "model.visual.blocks.11.attn.qkv",
      "model.visual.blocks.11.attn.proj",
      "model.visual.blocks.11.mlp.gate_proj",
      "model.visual.blocks.11.mlp.up_proj",
      "model.visual.blocks.11.mlp.down_proj",
      "model.visual.blocks.12.attn.qkv",
      "model.visual.blocks.12.attn.proj",
      "model.visual.blocks.12.mlp.gate_proj",
      "model.visual.blocks.12.mlp.up_proj",
      "model.visual.blocks.12.mlp.down_proj",
      "model.visual.blocks.13.attn.qkv",
      "model.visual.blocks.13.attn.proj",
      "model.visual.blocks.13.mlp.gate_proj",
      "model.visual.blocks.13.mlp.up_proj",
      "model.visual.blocks.13.mlp.down_proj",
      "model.visual.blocks.14.attn.qkv",
      "model.visual.blocks.14.attn.proj",
      "model.visual.blocks.14.mlp.gate_proj",
      "model.visual.blocks.14.mlp.up_proj",
      "model.visual.blocks.14.mlp.down_proj",
      "model.visual.blocks.15.attn.qkv",
      "model.visual.blocks.15.attn.proj",
      "model.visual.blocks.15.mlp.gate_proj",
      "model.visual.blocks.15.mlp.up_proj",
      "model.visual.blocks.15.mlp.down_proj",
      "model.visual.blocks.16.attn.qkv",
      "model.visual.blocks.16.attn.proj",
      "model.visual.blocks.16.mlp.gate_proj",
      "model.visual.blocks.16.mlp.up_proj",
      "model.visual.blocks.16.mlp.down_proj",
      "model.visual.blocks.17.attn.qkv",
      "model.visual.blocks.17.attn.proj",
      "model.visual.blocks.17.mlp.gate_proj",
      "model.visual.blocks.17.mlp.up_proj",
      "model.visual.blocks.17.mlp.down_proj",
      "model.visual.blocks.18.attn.qkv",
      "model.visual.blocks.18.attn.proj",
      "model.visual.blocks.18.mlp.gate_proj",
      "model.visual.blocks.18.mlp.up_proj",
      "model.visual.blocks.18.mlp.down_proj",
      "model.visual.blocks.19.attn.qkv",
      "model.visual.blocks.19.attn.proj",
      "model.visual.blocks.19.mlp.gate_proj",
      "model.visual.blocks.19.mlp.up_proj",
      "model.visual.blocks.19.mlp.down_proj",
      "model.visual.blocks.20.attn.qkv",
      "model.visual.blocks.20.attn.proj",
      "model.visual.blocks.20.mlp.gate_proj",
      "model.visual.blocks.20.mlp.up_proj",
      "model.visual.blocks.20.mlp.down_proj",
      "model.visual.blocks.21.attn.qkv",
      "model.visual.blocks.21.attn.proj",
      "model.visual.blocks.21.mlp.gate_proj",
      "model.visual.blocks.21.mlp.up_proj",
      "model.visual.blocks.21.mlp.down_proj",
      "model.visual.blocks.22.attn.qkv",
      "model.visual.blocks.22.attn.proj",
      "model.visual.blocks.22.mlp.gate_proj",
      "model.visual.blocks.22.mlp.up_proj",
      "model.visual.blocks.22.mlp.down_proj",
      "model.visual.blocks.23.attn.qkv",
      "model.visual.blocks.23.attn.proj",
      "model.visual.blocks.23.mlp.gate_proj",
      "model.visual.blocks.23.mlp.up_proj",
      "model.visual.blocks.23.mlp.down_proj",
      "model.visual.blocks.24.attn.qkv",
      "model.visual.blocks.24.attn.proj",
      "model.visual.blocks.24.mlp.gate_proj",
      "model.visual.blocks.24.mlp.up_proj",
      "model.visual.blocks.24.mlp.down_proj",
      "model.visual.blocks.25.attn.qkv",
      "model.visual.blocks.25.attn.proj",
      "model.visual.blocks.25.mlp.gate_proj",
      "model.visual.blocks.25.mlp.up_proj",
      "model.visual.blocks.25.mlp.down_proj",
      "model.visual.blocks.26.attn.qkv",
      "model.visual.blocks.26.attn.proj",
      "model.visual.blocks.26.mlp.gate_proj",
      "model.visual.blocks.26.mlp.up_proj",
      "model.visual.blocks.26.mlp.down_proj",
      "model.visual.blocks.27.attn.qkv",
      "model.visual.blocks.27.attn.proj",
      "model.visual.blocks.27.mlp.gate_proj",
      "model.visual.blocks.27.mlp.up_proj",
      "model.visual.blocks.27.mlp.down_proj",
      "model.visual.blocks.28.attn.qkv",
      "model.visual.blocks.28.attn.proj",
      "model.visual.blocks.28.mlp.gate_proj",
      "model.visual.blocks.28.mlp.up_proj",
      "model.visual.blocks.28.mlp.down_proj",
      "model.visual.blocks.29.attn.qkv",
      "model.visual.blocks.29.attn.proj",
      "model.visual.blocks.29.mlp.gate_proj",
      "model.visual.blocks.29.mlp.up_proj",
      "model.visual.blocks.29.mlp.down_proj",
      "model.visual.blocks.30.attn.qkv",
      "model.visual.blocks.30.attn.proj",
      "model.visual.blocks.30.mlp.gate_proj",
      "model.visual.blocks.30.mlp.up_proj",
      "model.visual.blocks.30.mlp.down_proj",
      "model.visual.blocks.31.attn.qkv",
      "model.visual.blocks.31.attn.proj",
      "model.visual.blocks.31.mlp.gate_proj",
      "model.visual.blocks.31.mlp.up_proj",
      "model.visual.blocks.31.mlp.down_proj",
      "model.visual.merger.mlp.0",
      "model.visual.merger.mlp.2",
      "lm_head"
    ],
    "kv_cache_scheme": null,
    "quant_method": "compressed-tensors",
    "quantization_status": "compressed"
  },
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "mrope_section": [
      16,
      24,
      24
    ],
    "rope_type": "default",
    "type": "default"
  },
  "rope_theta": 1000000.0,
  "sliding_window": 32768,
  "text_config": {
    "architectures": [
      "Qwen2_5_VLForConditionalGeneration"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "hidden_act": "silu",
    "hidden_size": 3584,
    "image_token_id": null,
    "initializer_range": 0.02,
    "intermediate_size": 18944,
    "layer_types": [
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention"
    ],
    "max_position_embeddings": 128000,
    "max_window_layers": 28,
    "model_type": "qwen2_5_vl_text",
    "num_attention_heads": 28,
    "num_hidden_layers": 28,
    "num_key_value_heads": 4,
    "rms_norm_eps": 1e-06,
    "rope_scaling": {
      "mrope_section": [
        16,
        24,
        24
      ],
      "rope_type": "default",
      "type": "default"
    },
    "rope_theta": 1000000.0,
    "sliding_window": null,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "use_sliding_window": false,
    "video_token_id": null,
    "vision_end_token_id": 151653,
    "vision_start_token_id": 151652,
    "vision_token_id": 151654,
    "vocab_size": 152064
  },
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.53.2",
  "use_cache": true,
  "use_sliding_window": false,
  "video_token_id": 151656,
  "vision_config": {
    "depth": 32,
    "fullatt_block_indexes": [
      7,
      15,
      23,
      31
    ],
    "hidden_act": "silu",
    "hidden_size": 1280,
    "in_channels": 3,
    "in_chans": 3,
    "initializer_range": 0.02,
    "intermediate_size": 3420,
    "model_type": "qwen2_5_vl",
    "num_heads": 16,
    "out_hidden_size": 3584,
    "patch_size": 14,
    "spatial_merge_size": 2,
    "spatial_patch_size": 14,
    "temporal_patch_size": 2,
    "tokens_per_second": 2,
    "torch_dtype": "bfloat16",
    "window_size": 112
  },
  "vision_end_token_id": 151653,
  "vision_start_token_id": 151652,
  "vision_token_id": 151654,
  "vocab_size": 152064
}