---
source_image: page_107.png
page_number: 107
model: model-run-olm-ocr
prompt_type: olmocr_technical
processing_time: 29.35
tokens: 7406
characters: 1536
timestamp: 2025-12-24T08:48:36.671526
finish_reason: stop
---

Операторы in и not in проверяют, содержится ли одна строка в другой, возвращая соответственно значение True или False.

Знание программирования позволит вам выполнять шифрование или дешифрование сообщений с помощью шифра Цезаря, используя язык, понятный компьютеру. И коль скоро компьютер понимает, какие действия он должен выполнить, он делает это гораздо быстрее человека, причем не допуская ошибок (если только ошибки не вкрались в саму программу). Несмотря на необычайную полезность шифра Цезаря, оказывается, что его нетрудно взломать тому, кто знаком с программированием. В главе 6 вы воспользуетесь полученными навыками, чтобы написать программу взлома шифра Цезаря. Это позволит вам читать тексты, зашифрованные другими людьми. Итак, нам предстоит научиться взламывать шифры!

Контрольные вопросы

Ответы на контрольные вопросы приведены в приложении Б.

1. Используйте программу caesarCipher.py для шифрования следующих сообщений с помощью указанных ключей.
   А. '"You can show black is white by argument," said Filby, "but you will never convince me."' (ключ 8).
   Б. '1234567890' (ключ 21).

2. Используйте программу caesarCipher.py для дешифрования следующих зашифрованных сообщений с помощью указанных ключей.
   А. 'Kv?uqwpfu?rncwukdng?gpqwijB' (ключ 2).
   Б. 'XCBSw88S18A1S 2SB41SE .8zSEwAS50D5A5x81V' (ключ 22).

3. Какая инструкция Python будет импортировать модуль watermelon.py?

4. Что будут выводить на экран следующие фрагменты кода?
   А.
   spam = 'foo'
   for i in spam:
       spam = spam + i
   print(spam)